In [ ]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [ ]:
import pandas as pd

In [ ]:
s=pd.Series(('Jen','Neil','Jay','Dan','Kev','Mo'))
print(s)

0     Jen
1    Neil
2     Jay
3     Dan
4     Kev
5      Mo
dtype: object

In [ ]:
print(s[1])

Neil

In [ ]:
print(s[2:4])

2    Jay
3    Dan
dtype: object

In [ ]:
print(s[[0,1,2,5]])

0     Jen
1    Neil
2     Jay
5      Mo
dtype: object

In [ ]:
param = s!='Jen'
print(s[param])

1    Neil
2     Jay
3     Dan
4     Kev
5      Mo
dtype: object

In [ ]:
d = {'Jen': 16,
     'Neil': 38,
     'Jay': 29,
     'Dan': 7,
     'Kev': 37,
     'Mo': 30}
people = pd.Series(d)
print(people)

Jen     16
Neil    38
Jay     29
Dan      7
Kev     37
Mo      30
dtype: int64

In [ ]:
people[['Dan', 'Kev']]

Dan     7
Kev    37
dtype: int64

In [ ]:
people[people>20]

Neil    38
Jay     29
Kev     37
Mo      30
dtype: int64

In [ ]:
people[people<20]=35
print(people)

Jen     35
Neil    38
Jay     29
Dan     35
Kev     37
Mo      30
dtype: int64

In [ ]:
titanic = pd.read_csv('Titanic.txt', sep='\t')
print(titanic.head())

  pclass    age   sex survived
0    1st  adult  male      yes
1    1st  adult  male      yes
2    1st  adult  male      yes
3    1st  adult  male      yes
4    1st  adult  male      yes

In [ ]:
titanic['age']

0       adult
1       adult
2       adult
3       adult
4       adult
        ...
2196    adult
2197    adult
2198    adult
2199    adult
2200    adult
Name: age, Length: 2201, dtype: object

In [ ]:
titanic[['age','pclass']]

        age pclass
0     adult    1st
1     adult    1st
2     adult    1st
3     adult    1st
4     adult    1st
...     ...    ...
2196  adult   crew
2197  adult   crew
2198  adult   crew
2199  adult   crew
2200  adult   crew

[2201 rows x 2 columns]

In [ ]:
titanic[(titanic.age=='child') & (titanic.pclass=='2nd')]

    pclass    age     sex survived
586    2nd  child    male      yes
587    2nd  child    male      yes
588    2nd  child    male      yes
589    2nd  child    male      yes
590    2nd  child    male      yes
591    2nd  child    male      yes
592    2nd  child    male      yes
593    2nd  child    male      yes
594    2nd  child    male      yes
595    2nd  child    male      yes
596    2nd  child    male      yes
597    2nd  child  female      yes
598    2nd  child  female      yes
599    2nd  child  female      yes
600    2nd  child  female      yes
601    2nd  child  female      yes
602    2nd  child  female      yes
603    2nd  child  female      yes
604    2nd  child  female      yes
605    2nd  child  female      yes
606    2nd  child  female      yes
607    2nd  child  female      yes
608    2nd  child  female      yes
609    2nd  child  female      yes

In [ ]:
titanic[600:610]

    pclass    age     sex survived
600    2nd  child  female      yes
601    2nd  child  female      yes
602    2nd  child  female      yes
603    2nd  child  female      yes
604    2nd  child  female      yes
605    2nd  child  female      yes
606    2nd  child  female      yes
607    2nd  child  female      yes
608    2nd  child  female      yes
609    2nd  child  female      yes

In [ ]:
by_age = titanic.groupby('age')
by_age.size()

age
adult    2092
child     109
dtype: int64

In [ ]:
print(titanic.groupby(['sex']).size())

sex
female     470
male      1731
dtype: int64

In [ ]:
print(titanic.groupby(['survived', 'sex']).size())

survived  sex
no        female     126
          male      1364
yes       female     344
          male       367
dtype: int64